var hash = {"习近平总书记对广东工作的重要批示中，“四个坚持”为: 坚持党的领导、坚持中国特色社会主义、":"A","习近平总书记对广东工作的重要批示中，“三个支撑”为: 为全国推进供给侧结构性改革、":"C","习近平总书记对广东工作的重要批示中，“两个走在前列”为: 努力在":"B","我们一定要以":"C","过去五年，广东经济综合实力显著增强，全省地区生产总值从5.32万亿元增加到7.95万亿元，年均增长8.0％，总量连续":"C","未来五年，我省将建设面向未来的现代化基础设施。加快建设覆盖全省、通达全国、连通世界的现代化综合交通运输体系。建设高速公路大通道，形成“十纵六横两环”高速公路骨干网，通车里程超过":"A","未来五年，我省将着力打造创新人才高地。加快建设":"B","推进“两学一做”学习教育常态化制度化，坚持抓住“关键少数”与":"B","广东已经发展到了“先富帮后富、最终实现共同富裕”的关键阶段。经过多年接续努力，珠三角辐射带动能力不断增强，粤东西北地区发展条件显著改善，":"A","":"D","“三个代表”重要思想的本质是":"A","隐瞒入党前严重错误的，一般应当予以":"C","最先在中国提出“中国共产党”这个名称的是":"C","中共中央在":"B","坚持不忘初心、继续前进，就要坚持马克思主义的指导地位，坚持把马克思主义基本原理同当代中国实际和时代特点紧密结合起来，推进理论创新、实践创新，不断把":"B","党的":"C","《党章》规定，党的各级领导干部要正确行使人民赋予的权力，":"B","受国家机关、国有公司、企业、事业单位、人民团体委托管理、经营":"B","《党章》总纲强调，要以改革创新精神全面推进s建设新的伟大工程，整体推进党的思想建设、组织建设、作风建设、":"B","井冈山革命根据地的建立和巩固的重大意义是":"D","党的基层委员会每届任期三年至五年，总支部委员会、支部委员会每届任期":"C","《中国共产党廉洁自律准则》分为两部分：一是党员廉洁自律规范；二是":"C","现阶段我们党的统一战线是在中国共产党领导下由全体社会主义劳动者、社会主义事业的":"A","习近平总书记对廖俊波同志先进事迹作出重要指示，号召广大党员、干部要向廖俊波同志学习，不忘初心、":"A","预备党员的":"C","国共产党纪律处分条例》规定，在干部选拔任用工作中，违反干部选拔任用规定的，追究":"D","国家机关工作人员严重不负责任，不履行或者不认真履行职责，致使公共财产、国家和人民利益遭受重大损失的行为，构成":"B","全国解放战争三大战役中，历时最长、规模最大、歼敌数量最多的是":"B","红军长征的胜利预示着":"A","我们要顺应人民群众对美好生活的向往，坚持":"C","《中国共产党纪律处分条例》规定，撤销党内职务处分，如果决定撤销其某个职务，必须撤销其担任的最高职务。如果决定撤销其两个以上职务，则必须从其担任的":"A","《党章》规定，党员的党龄，从":"D","诬告陷害他人意在使他人受":"B","党的各级纪律检查委员会的主要任务是：维护党的章程和其他党内法规，检查党的路线、方针、政策和决议的执行情况，协助党的委员会加强党风建设和":"C","党的十五大把":"B","《党章》规定，对于严重触犯刑律的党员，必须":"A","坚持不忘初心、继续前进，就要牢记我们党从成立起就把为共产主义、社会主义而奋斗确定为自己的纲领，坚定共产主义远大理想和":"C","各级领导干部要对法律怀有敬畏之心，带头依法办事，带头遵守法律，不断提高运用":"D","《党章》指出，党的上下级组织之间要互通情报、互相支持和":"A","五四运动标志着中国":"B","《党章》规定，党员除了享有表决权、选举权和被选举权以外，还有权要求":"B","《党章》规定，党员经过留党察看，确已改正错误的，应当恢复其党员的权利；坚持错误不改的，应当":"C","让人民支持和帮助我们从严治党，要注意畅通两个渠道，一个是建言献策渠道，一个是":"C","党员领导干部利用职权或职务上的影响大操大办儿子婚礼，在社会上造成不良影响，情节严重的，依据《中国共产党纪律处分条例》，应给予":"B","坚决维护党中央权威、保证全党令行禁止，是党和国家前途命运所系，是全国各族人民根本利益所在，也是加强和规范党内政治生活的":"D","中国人民民主革命胜利的标志是":"D","干涉群众生产经营自主权，致使群众财产遭受":"B","《党章》规定，党选拔干部坚持":"A","领导干部要发扬":"C","违纪党员在党组织作出处分决定前死亡，或者在死亡之后发现其曾有严重违纪行为，对于应当给予开除党籍处分的，开除其党籍；对于应当给予留党察看以下（含留党察看）处分的，作出":"A","全党要以自我革命的政治勇气，着力解决党自身存在的突出问题，不断增强党自我净化、自我完善、":"C","在中国大地上举起俄国十月社会主义革命旗帜的第一人是":"B","中国特色社会主义理论体系是包括邓小平理论、“三个代表”重要思想和":"C","党要管党、从严治党，靠什么管，凭什么治？就要靠":"D","宋庆龄说：“孙中山与中国共产党之间具有历史意义的合作不是偶然的，它是当时的国际局势和中国本身的内部条件造成的。”她话中的“国际局势”和“内部条件”是指":"B","《中国共产党纪律处分条例》所称主动交代，是指涉嫌违纪的党员在组织":"B","1978年12月召开的":"C","当前“为官不为”主要有3种情况：一是能力不足而“不能为”，二是动力不足而“不想为”，三是担当不足而":"D","坚持不忘初心、继续前进，就要保持党的先进性和纯洁性，着力提高执政能力和领导水平，着力增强抵御风险和拒腐防变能力，不断把":"B","党员领导干部对违反政治纪律和政治规矩等错误思想和行为放任不管，搞无原则一团和气，造成不良影响的，给予":"A","毛泽东思想的活的灵魂有三个基本方面，即":"A","抗日战争胜利后，为争取全国人民渴望的和平民主，中国共产党和国民党举行了":"C","《党章》规定，党员必须发扬社会主义新风尚，带头实践社会主义荣辱观，提倡":"D","《党章》规定，这重大问题，党的各级委员会都要按照集体领导、民主集中、个别酝酿、":"A","概括起来说，好干部要做到信念坚定、为民服务、勤政务实、":"B","以第二次国共合作为基础的抗日民族统一战线正式形成的标志是":"C","党的各级代表大会的代表和委员会的产生，要体现":"B","《中国共产党纪律处分条例》规定，不按照有关规定或者工作要求，向组织请示报告重大问题、重要事项的，给予警告或者严重警告处分；情节严重的，给予撤销党内职务或者":"C","《党章》规定，中国共产党要领导全国各族人民实现社会主义现代化的宏伟目标，必须紧密围绕党的基本路线，加强党的执政能力建设、":"D","党章是最根本的党内法规，是管党治党的总规矩。党的纪律是党的各级组织和":"C","延安整风运动的基本方针是":"B","毛泽东系统阐述人民民主专政理论的代表作是":"D","党员领导干部对违反":"D","《党章》规定的共产党员必须履行的第一项义务是：认真学习马克思列宁主义、毛泽东思想、邓小平理论和":"B","第一次提出“毛泽东思想”这一概念的是":"B","《党章》规定，任何党员不论职务高低，都不能个人决定重大问题；如遇紧急情况，必须由个人作出决定时，事后要迅速向党组织报告。不允许任何领导人":"D","对于受到撤销党内职务以上（含撤销党内职务）处分的，还应当在":"A","《党章》规定，我们党的最大政治优势是密切联系群众，党执政后的最大危险是脱离群众。":"A","打响武装反抗国民党反动派第一枪的起义是":"A","全国解放战争时期，党领导的第一次大规模的学生爱国民主运动是":"B","通过信息网络、广播、电视、报刊、书籍、讲座、论坛、报告会、座谈会等方式，公开发表坚持资产阶级自由化立场、反对四项基本原则、反对x改革开放决策的文章、演说、宣言、声明等的，给予":"D","从严治党，最根本的就是要使全党各级组织和全体党员、干部都按照":"C","《党章》规定，党的各级纪律检查委员会的主要任务是：维护党的章程和其他党内法规，检查党的路线、方针、政策和决议的执行情况，":"C","解决党内存在的种种难题，必须营造一个良好从政环境，也就是要有一个好的":"B","我们党历来重视抓全党特别是领导干部的":"C","《党章》规定，对党员的纪律处分，必须经过":"A","培育和弘扬社会主义核心价值观必须立足":"D","凡是成立党的新组织，或是撤销党的原有组织，必须由":"A","我们要永远保持建党时中国共产党人的奋斗精神，永远保持对人民的赤子之心。一切向前走，都不能忘记走过的路；走得再远、走到再光辉的未来，也不能忘记走过的过去，不能忘记为什么出发。面向未来，面对挑战，全党同志一定要":"B","《中国共产党纪律处分条例》规定，在党内搞团团伙伙、结党营私、拉帮结派、培植私人势力或者通过搞利益交换、为自己营造声势等活动捞取政治资本的，给予严重警告或者撤销党内职务处分；情节严重的，给予留党察看或者":"D","党的思想路线是":"C","邓小平最早提出“建设有中国特色社会主义”命题是在":"B","《党章》规定，党的纪律处分有":"A","从严治党靠教育，也靠":"B","党的中央纪律检查委员会根据工作需要，可以向中央一级党和国家机关派驻党的纪律检查组或纪律检查员。纪律检查组组长或纪律检查员可以":"B","《党章》规定，党的民主集中制的基本原则之一是“四个服从”，即党员个人服从党的组织，":"B","《党章》规定，党员必须密切联系群众，向群众宣传党的主张，遇事同群众商量，及时向党反映群众的意见和要求，维护":"A","中国新民主主义革命胜利的三大法宝：":"D","党组织在纪律审查中发现党员有":"C","我们党是靠革命理想和":"D","“雄关漫道真如铁，而今迈步从头越。”写于遵义会议后，对毛泽东这一词句的理解，最贴近其历史寓意的是":"B","党章规定了纪委的3项主要任务和5项经常性工作，概括起来，就是":"D","《党章》规定，当党员对党的决议和政策有不同意见时，下列说法中，正确的应该是":"B","搞权色交易或者给予财物搞":"C","受到改组处理的党组织领导机构成员，除应当受到撤销党内职务以上（含撤销党内职务）处分的外，均":"C","《中国共产党纪律处分条例》规定，党员受到开除党籍处分，":"D","党的全国代表大会每五年举行一次，由中央委员会召集。中央委员会认为有必要，或者有":"B","加强和规范党内政治生活的根本要求是坚持":"B","《党章》中关于党员权利，下列说法中，错误的应该是":"A","新型政商关系应该是什么样的？概括起来说，就是“亲”、":"D","脱贫攻坚要取得实实在在的效果，必须因地制宜，探索多渠道、多元化的":"B","中国共产党坚持实行":"A","遵守党的政治纪律，最核心的，就是":"D","全党同志要强化党的意识，始终把党放在心中最高位置，牢记自己的第一身份是":"D","《党章》规定，中国共产党党员永远是劳动人民的普通一员。除了法律和政策规定范围内的个人利益和工作职权以外，所有共产党员都不得谋求任何":"A","全党同志要增强政治意识、大局意识、核心意识、看齐意识，切实做到":"A","遇到国家财产和群众生命财产受到":"B","对违纪后下落不明的党员有严重违纪行为，除应当给予开除党籍处分的外，下落不明时间超过六个月的，党组织应当按照党章规定对其予以":"C","1978年12月召开的党的十一届三中全会，是新中国成立以来党的历史上具有深远意义的伟大转折。这次会议确定把全党的工作重点转移到":"A","我们要坚持“以百姓心为心”，倾听人民心声，汲取人民智慧，始终把实现好、维护好、发展好最广大人民根本利益作为一切工作的出发点和落脚点，让":"B","党员有权向党负责地揭发、检举党的任何组织和任何党员违纪违法的事实，":"B","当前和今后一个时期，制约我国经济发展的因素，供给和需求两侧都有，但矛盾的主要方面在":"C","违反有关规定取得、持有、实际使用运动健身卡、会所和俱乐部会员卡、高尔夫球卡等各种消费卡，或者违反有关规定出入私人会所，情节较重的，给予":"C","《党章》规定，党按照":"B","《中国共产党纪律处分条例》规定，以营利为目的聚众赌博或者以赌博为业的，给予":"D","《党章》规定：党的各级代表大会代表实行":"B","各级各部门党委（党组）必须树立正确政绩观，坚持从巩固党的执政地位的大局看问题，把":"D","入党介绍人的任务是认真了解申请人的思想、品质、经历和工作表现，向他解释":"B","《党章》总纲指出：马克思列宁主义揭示了":"C","《党章》规定，党员必须切实开展批评和自我批评，勇于揭露和纠正工作中的缺点、错误，坚决":"B","《党章》规定，党员对党组织作出的处分决定不服，可以提出":"C","“三个代表”重要思想在":"A","我们党确立全面抗战路线的会议是":"C","各级领导干部要加快知识更新、加强实践锻炼，使专业素养和工作能力跟上时代节拍，避免少知而迷、无知而乱，努力成为做好工作的":"B","违反党的优良传统和":"A","坚持社会主义道路、坚持人民民主专政、坚持":"A"};

var tmp, start, end;
var flag = 0;

$("iframe#myIframe").contents().find(".txtMg").each(function(idx, item){
	
	tmp = $("span", item).text();
        //console.log(tmp);

	start = tmp.indexOf('、');
	end = tmp.indexOf('_');

	var sIdx = hash[tmp.substring(start + 1, end)];

	var idx =0;
	if( sIdx == "A")
	{
		idx = 0;
	}
	else if( sIdx == "B")
	{
		idx = 1;
	}
	else if( sIdx == "C")
	{
		idx = 2;
	}
	else if( sIdx == "D")
	{
		idx = 3;
	}

	if(flag == 0)
	{
		if(idx == 1)
		{
			idx = idx + 1;
		}
		flag = 1;
	}

	// var alala = $(item).children('ul').children('li')[idx];
	// $(alala).children('input').click();
        $("li input", item)[idx].click();
        //console.log( "opt = "+sIdx+"("+idx+")");
});
